Parametric Heatsink Simulation/Linux Files/pitch_7mm_nfins_10/0/fluid/T
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/fluid"; object T;
}
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    fan1_half0 { type fanPressureJump; patchType cyclic; jump uniform 0; value uniform 300; }
    fan1_half1 { type fanPressureJump; patchType cyclic; jump uniform 0; value uniform 300; }
    fan2_half0 { type fanPressureJump; patchType cyclic; jump uniform 0; value uniform 300; }
    fan2_half1 { type fanPressureJump; patchType cyclic; jump uniform 0; value uniform 300; }
    base_bottom { type zeroGradient; }
    top_wall    { type zeroGradient; }
    side_walls  { type zeroGradient; }
    fluid_to_solid { type turbulentTemperatureCoupledBaffleMixed; Tnbr T; kappaMethod fluidThermo; value uniform 300; }
}