Parametric Heatsink Simulation/Linux Files/pitch_7mm_nfins_10/0/solid/T
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/solid"; object T;
}
dimensions [0 0 0 1 0 0 0];
internalField uniform 300;
boundaryField
{
    base_bottom  { type zeroGradient; }
    solid_to_fluid { type turbulentTemperatureCoupledBaffleMixed; Tnbr T; kappaMethod solidThermo; value uniform 300; }
}