Parametric Heatsink Simulation/Linux Files/pitch_7mm_nfins_10/system/blockMeshDict
FoamFile
{
    version 2.0; format ascii;
    class dictionary; object blockMeshDict;
}

scale 1;

vertices
(
    (0.0000000e+00 0.0000000e+00 0.0000000e+00)
    (7.7500000e-03 0.0000000e+00 0.0000000e+00)
    (9.2500000e-03 0.0000000e+00 0.0000000e+00)
    (1.4750000e-02 0.0000000e+00 0.0000000e+00)
    (1.6250000e-02 0.0000000e+00 0.0000000e+00)
    (2.1750000e-02 0.0000000e+00 0.0000000e+00)
    (2.3250000e-02 0.0000000e+00 0.0000000e+00)
    (2.8750000e-02 0.0000000e+00 0.0000000e+00)
    (3.0250000e-02 0.0000000e+00 0.0000000e+00)
    (3.5750000e-02 0.0000000e+00 0.0000000e+00)
    (3.7250000e-02 0.0000000e+00 0.0000000e+00)
    (4.2750000e-02 0.0000000e+00 0.0000000e+00)
    (4.4250000e-02 0.0000000e+00 0.0000000e+00)
    (4.9750000e-02 0.0000000e+00 0.0000000e+00)
    (5.1250000e-02 0.0000000e+00 0.0000000e+00)
    (5.6750000e-02 0.0000000e+00 0.0000000e+00)
    (5.8250000e-02 0.0000000e+00 0.0000000e+00)
    (6.3750000e-02 0.0000000e+00 0.0000000e+00)
    (6.5250000e-02 0.0000000e+00 0.0000000e+00)
    (7.0750000e-02 0.0000000e+00 0.0000000e+00)
    (7.2250000e-02 0.0000000e+00 0.0000000e+00)
    (8.0000000e-02 0.0000000e+00 0.0000000e+00)
    (0.0000000e+00 5.0000000e-03 0.0000000e+00)
    (7.7500000e-03 5.0000000e-03 0.0000000e+00)
    (9.2500000e-03 5.0000000e-03 0.0000000e+00)
    (1.4750000e-02 5.0000000e-03 0.0000000e+00)
    (1.6250000e-02 5.0000000e-03 0.0000000e+00)
    (2.1750000e-02 5.0000000e-03 0.0000000e+00)
    (2.3250000e-02 5.0000000e-03 0.0000000e+00)
    (2.8750000e-02 5.0000000e-03 0.0000000e+00)
    (3.0250000e-02 5.0000000e-03 0.0000000e+00)
    (3.5750000e-02 5.0000000e-03 0.0000000e+00)
    (3.7250000e-02 5.0000000e-03 0.0000000e+00)
    (4.2750000e-02 5.0000000e-03 0.0000000e+00)
    (4.4250000e-02 5.0000000e-03 0.0000000e+00)
    (4.9750000e-02 5.0000000e-03 0.0000000e+00)
    (5.1250000e-02 5.0000000e-03 0.0000000e+00)
    (5.6750000e-02 5.0000000e-03 0.0000000e+00)
    (5.8250000e-02 5.0000000e-03 0.0000000e+00)
    (6.3750000e-02 5.0000000e-03 0.0000000e+00)
    (6.5250000e-02 5.0000000e-03 0.0000000e+00)
    (7.0750000e-02 5.0000000e-03 0.0000000e+00)
    (7.2250000e-02 5.0000000e-03 0.0000000e+00)
    (8.0000000e-02 5.0000000e-03 0.0000000e+00)
    (0.0000000e+00 4.0000000e-02 0.0000000e+00)
    (7.7500000e-03 4.0000000e-02 0.0000000e+00)
    (9.2500000e-03 4.0000000e-02 0.0000000e+00)
    (1.4750000e-02 4.0000000e-02 0.0000000e+00)
    (1.6250000e-02 4.0000000e-02 0.0000000e+00)
    (2.1750000e-02 4.0000000e-02 0.0000000e+00)
    (2.3250000e-02 4.0000000e-02 0.0000000e+00)
    (2.8750000e-02 4.0000000e-02 0.0000000e+00)
    (3.0250000e-02 4.0000000e-02 0.0000000e+00)
    (3.5750000e-02 4.0000000e-02 0.0000000e+00)
    (3.7250000e-02 4.0000000e-02 0.0000000e+00)
    (4.2750000e-02 4.0000000e-02 0.0000000e+00)
    (4.4250000e-02 4.0000000e-02 0.0000000e+00)
    (4.9750000e-02 4.0000000e-02 0.0000000e+00)
    (5.1250000e-02 4.0000000e-02 0.0000000e+00)
    (5.6750000e-02 4.0000000e-02 0.0000000e+00)
    (5.8250000e-02 4.0000000e-02 0.0000000e+00)
    (6.3750000e-02 4.0000000e-02 0.0000000e+00)
    (6.5250000e-02 4.0000000e-02 0.0000000e+00)
    (7.0750000e-02 4.0000000e-02 0.0000000e+00)
    (7.2250000e-02 4.0000000e-02 0.0000000e+00)
    (8.0000000e-02 4.0000000e-02 0.0000000e+00)
    (0.0000000e+00 8.0000000e-02 0.0000000e+00)
    (7.7500000e-03 8.0000000e-02 0.0000000e+00)
    (9.2500000e-03 8.0000000e-02 0.0000000e+00)
    (1.4750000e-02 8.0000000e-02 0.0000000e+00)
    (1.6250000e-02 8.0000000e-02 0.0000000e+00)
    (2.1750000e-02 8.0000000e-02 0.0000000e+00)
    (2.3250000e-02 8.0000000e-02 0.0000000e+00)
    (2.8750000e-02 8.0000000e-02 0.0000000e+00)
    (3.0250000e-02 8.0000000e-02 0.0000000e+00)
    (3.5750000e-02 8.0000000e-02 0.0000000e+00)
    (3.7250000e-02 8.0000000e-02 0.0000000e+00)
    (4.2750000e-02 8.0000000e-02 0.0000000e+00)
    (4.4250000e-02 8.0000000e-02 0.0000000e+00)
    (4.9750000e-02 8.0000000e-02 0.0000000e+00)
    (5.1250000e-02 8.0000000e-02 0.0000000e+00)
    (5.6750000e-02 8.0000000e-02 0.0000000e+00)
    (5.8250000e-02 8.0000000e-02 0.0000000e+00)
    (6.3750000e-02 8.0000000e-02 0.0000000e+00)
    (6.5250000e-02 8.0000000e-02 0.0000000e+00)
    (7.0750000e-02 8.0000000e-02 0.0000000e+00)
    (7.2250000e-02 8.0000000e-02 0.0000000e+00)
    (8.0000000e-02 8.0000000e-02 0.0000000e+00)
    (0.0000000e+00 0.0000000e+00 1.0500000e-01)
    (7.7500000e-03 0.0000000e+00 1.0500000e-01)
    (9.2500000e-03 0.0000000e+00 1.0500000e-01)
    (1.4750000e-02 0.0000000e+00 1.0500000e-01)
    (1.6250000e-02 0.0000000e+00 1.0500000e-01)
    (2.1750000e-02 0.0000000e+00 1.0500000e-01)
    (2.3250000e-02 0.0000000e+00 1.0500000e-01)
    (2.8750000e-02 0.0000000e+00 1.0500000e-01)
    (3.0250000e-02 0.0000000e+00 1.0500000e-01)
    (3.5750000e-02 0.0000000e+00 1.0500000e-01)
    (3.7250000e-02 0.0000000e+00 1.0500000e-01)
...
);

blocks
(
    hex (0 1 23 22 88 89 111 110) fluid (4 4 25) simpleGrading (1 1 1)
    hex (1 2 24 23 89 90 112 111) fluid (4 4 25) simpleGrading (1 1 1)
    hex (2 3 25 24 90 91 113 112) fluid (8 4 25) simpleGrading (1 1 1)
    hex (3 4 26 25 91 92 114 113) fluid (4 4 25) simpleGrading (1 1 1)
    hex (4 5 27 26 92 93 115 114) fluid (8 4 25) simpleGrading (1 1 1)
    hex (5 6 28 27 93 94 116 115) fluid (4 4 25) simpleGrading (1 1 1)
    hex (6 7 29 28 94 95 117 116) fluid (8 4 25) simpleGrading (1 1 1)
    hex (7 8 30 29 95 96 118 117) fluid (4 4 25) simpleGrading (1 1 1)
    hex (8 9 31 30 96 97 119 118) fluid (8 4 25) simpleGrading (1 1 1)
    hex (9 10 32 31 97 98 120 119) fluid (4 4 25) simpleGrading (1 1 1)
    hex (10 11 33 32 98 99 121 120) fluid (8 4 25) simpleGrading (1 1 1)
    hex (11 12 34 33 99 100 122 121) fluid (4 4 25) simpleGrading (1 1 1)
    hex (12 13 35 34 100 101 123 122) fluid (8 4 25) simpleGrading (1 1 1)
    hex (13 14 36 35 101 102 124 123) fluid (4 4 25) simpleGrading (1 1 1)
    hex (14 15 37 36 102 103 125 124) fluid (8 4 25) simpleGrading (1 1 1)
    hex (15 16 38 37 103 104 126 125) fluid (4 4 25) simpleGrading (1 1 1)
    hex (16 17 39 38 104 105 127 126) fluid (8 4 25) simpleGrading (1 1 1)
    hex (17 18 40 39 105 106 128 127) fluid (4 4 25) simpleGrading (1 1 1)
    hex (18 19 41 40 106 107 129 128) fluid (8 4 25) simpleGrading (1 1 1)
    hex (19 20 42 41 107 108 130 129) fluid (4 4 25) simpleGrading (1 1 1)
    hex (20 21 43 42 108 109 131 130) fluid (4 4 25) simpleGrading (1 1 1)
    hex (22 23 45 44 110 111 133 132) fluid (4 18 25) simpleGrading (1 1 1)
    hex (23 24 46 45 111 112 134 133) fluid (4 18 25) simpleGrading (1 1 1)
    hex (24 25 47 46 112 113 135 134) fluid (8 18 25) simpleGrading (1 1 1)
    hex (25 26 48 47 113 114 136 135) fluid (4 18 25) simpleGrading (1 1 1)
    hex (26 27 49 48 114 115 137 136) fluid (8 18 25) simpleGrading (1 1 1)
    hex (27 28 50 49 115 116 138 137) fluid (4 18 25) simpleGrading (1 1 1)
    hex (28 29 51 50 116 117 139 138) fluid (8 18 25) simpleGrading (1 1 1)
    hex (29 30 52 51 117 118 140 139) fluid (4 18 25) simpleGrading (1 1 1)
    hex (30 31 53 52 118 119 141 140) fluid (8 18 25) simpleGrading (1 1 1)
    hex (31 32 54 53 119 120 142 141) fluid (4 18 25) simpleGrading (1 1 1)
    hex (32 33 55 54 120 121 143 142) fluid (8 18 25) simpleGrading (1 1 1)
    hex (33 34 56 55 121 122 144 143) fluid (4 18 25) simpleGrading (1 1 1)
    hex (34 35 57 56 122 123 145 144) fluid (8 18 25) simpleGrading (1 1 1)
    hex (35 36 58 57 123 124 146 145) fluid (4 18 25) simpleGrading (1 1 1)
    hex (36 37 59 58 124 125 147 146) fluid (8 18 25) simpleGrading (1 1 1)
    hex (37 38 60 59 125 126 148 147) fluid (4 18 25) simpleGrading (1 1 1)
    hex (38 39 61 60 126 127 149 148) fluid (8 18 25) simpleGrading (1 1 1)
    hex (39 40 62 61 127 128 150 149) fluid (4 18 25) simpleGrading (1 1 1)
    hex (40 41 63 62 128 129 151 150) fluid (8 18 25) simpleGrading (1 1 1)
    hex (41 42 64 63 129 130 152 151) fluid (4 18 25) simpleGrading (1 1 1)
    hex (42 43 65 64 130 131 153 152) fluid (4 18 25) simpleGrading (1 1 1)
    hex (44 45 67 66 132 133 155 154) fluid (4 12 25) simpleGrading (1 1 1)
    hex (45 46 68 67 133 134 156 155) fluid (4 12 25) simpleGrading (1 1 1)
    hex (46 47 69 68 134 135 157 156) fluid (8 12 25) simpleGrading (1 1 1)
    hex (47 48 70 69 135 136 158 157) fluid (4 12 25) simpleGrading (1 1 1)
    hex (48 49 71 70 136 137 159 158) fluid (8 12 25) simpleGrading (1 1 1)
    hex (49 50 72 71 137 138 160 159) fluid (4 12 25) simpleGrading (1 1 1)
    hex (50 51 73 72 138 139 161 160) fluid (8 12 25) simpleGrading (1 1 1)
    hex (51 52 74 73 139 140 162 161) fluid (4 12 25) simpleGrading (1 1 1)
    hex (52 53 75 74 140 141 163 162) fluid (8 12 25) simpleGrading (1 1 1)
    hex (53 54 76 75 141 142 164 163) fluid (4 12 25) simpleGrading (1 1 1)
    hex (54 55 77 76 142 143 165 164) fluid (8 12 25) simpleGrading (1 1 1)
    hex (55 56 78 77 143 144 166 165) fluid (4 12 25) simpleGrading (1 1 1)
    hex (56 57 79 78 144 145 167 166) fluid (8 12 25) simpleGrading (1 1 1)
    hex (57 58 80 79 145 146 168 167) fluid (4 12 25) simpleGrading (1 1 1)
    hex (58 59 81 80 146 147 169 168) fluid (8 12 25) simpleGrading (1 1 1)
    hex (59 60 82 81 147 148 170 169) fluid (4 12 25) simpleGrading (1 1 1)
    hex (60 61 83 82 148 149 171 170) fluid (8 12 25) simpleGrading (1 1 1)
    hex (61 62 84 83 149 150 172 171) fluid (4 12 25) simpleGrading (1 1 1)
    hex (62 63 85 84 150 151 173 172) fluid (8 12 25) simpleGrading (1 1 1)
    hex (63 64 86 85 151 152 174 173) fluid (4 12 25) simpleGrading (1 1 1)
    hex (64 65 87 86 152 153 175 174) fluid (4 12 25) simpleGrading (1 1 1)
    hex (88 89 111 110 176 177 199 198) solid (4 4 40) simpleGrading (1 1 1)
    hex (89 90 112 111 177 178 200 199) solid (4 4 40) simpleGrading (1 1 1)
    hex (90 91 113 112 178 179 201 200) solid (8 4 40) simpleGrading (1 1 1)
    hex (91 92 114 113 179 180 202 201) solid (4 4 40) simpleGrading (1 1 1)
    hex (92 93 115 114 180 181 203 202) solid (8 4 40) simpleGrading (1 1 1)
    hex (93 94 116 115 181 182 204 203) solid (4 4 40) simpleGrading (1 1 1)
    hex (94 95 117 116 182 183 205 204) solid (8 4 40) simpleGrading (1 1 1)
    hex (95 96 118 117 183 184 206 205) solid (4 4 40) simpleGrading (1 1 1)
    hex (96 97 119 118 184 185 207 206) solid (8 4 40) simpleGrading (1 1 1)
    hex (97 98 120 119 185 186 208 207) solid (4 4 40) simpleGrading (1 1 1)
    hex (98 99 121 120 186 187 209 208) solid (8 4 40) simpleGrading (1 1 1)
    hex (99 100 122 121 187 188 210 209) solid (4 4 40) simpleGrading (1 1 1)
    hex (100 101 123 122 188 189 211 210) solid (8 4 40) simpleGrading (1 1 1)
    hex (101 102 124 123 189 190 212 211) solid (4 4 40) simpleGrading (1 1 1)
    hex (102 103 125 124 190 191 213 212) solid (8 4 40) simpleGrading (1 1 1)
    hex (103 104 126 125 191 192 214 213) solid (4 4 40) simpleGrading (1 1 1)
    hex (104 105 127 126 192 193 215 214) solid (8 4 40) simpleGrading (1 1 1)
    hex (105 106 128 127 193 194 216 215) solid (4 4 40) simpleGrading (1 1 1)
    hex (106 107 129 128 194 195 217 216) solid (8 4 40) simpleGrading (1 1 1)
    hex (107 108 130 129 195 196 218 217) solid (4 4 40) simpleGrading (1 1 1)
    hex (108 109 131 130 196 197 219 218) solid (4 4 40) simpleGrading (1 1 1)
    hex (110 111 133 132 198 199 221 220) fluid (4 18 40) simpleGrading (1 1 1)
    hex (111 112 134 133 199 200 222 221) solid (4 18 40) simpleGrading (1 1 1)
    hex (112 113 135 134 200 201 223 222) fluid (8 18 40) simpleGrading (1 1 1)
    hex (113 114 136 135 201 202 224 223) solid (4 18 40) simpleGrading (1 1 1)
    hex (114 115 137 136 202 203 225 224) fluid (8 18 40) simpleGrading (1 1 1)
    hex (115 116 138 137 203 204 226 225) solid (4 18 40) simpleGrading (1 1 1)
    hex (116 117 139 138 204 205 227 226) fluid (8 18 40) simpleGrading (1 1 1)
    hex (117 118 140 139 205 206 228 227) solid (4 18 40) simpleGrading (1 1 1)
    hex (118 119 141 140 206 207 229 228) fluid (8 18 40) simpleGrading (1 1 1)
    hex (119 120 142 141 207 208 230 229) solid (4 18 40) simpleGrading (1 1 1)
    hex (120 121 143 142 208 209 231 230) fluid (8 18 40) simpleGrading (1 1 1)
    hex (121 122 144 143 209 210 232 231) solid (4 18 40) simpleGrading (1 1 1)
    hex (122 123 145 144 210 211 233 232) fluid (8 18 40) simpleGrading (1 1 1)
    hex (123 124 146 145 211 212 234 233) solid (4 18 40) simpleGrading (1 1 1)
    hex (124 125 147 146 212 213 235 234) fluid (8 18 40) simpleGrading (1 1 1)
    hex (125 126 148 147 213 214 236 235) solid (4 18 40) simpleGrading (1 1 1)
    hex (126 127 149 148 214 215 237 236) fluid (8 18 40) simpleGrading (1 1 1)
    hex (127 128 150 149 215 216 238 237) solid (4 18 40) simpleGrading (1 1 1)
    hex (128 129 151 150 216 217 239 238) fluid (8 18 40) simpleGrading (1 1 1)
    hex (129 130 152 151 217 218 240 239) solid (4 18 40) simpleGrading (1 1 1)
    hex (130 131 153 152 218 219 241 240) fluid (4 18 40) simpleGrading (1 1 1)
    hex (132 133 155 154 220 221 243 242) fluid (4 12 40) simpleGrading (1 1 1)
    hex (133 134 156 155 221 222 244 243) fluid (4 12 40) simpleGrading (1 1 1)
    hex (134 135 157 156 222 223 245 244) fluid (8 12 40) simpleGrading (1 1 1)
    hex (135 136 158 157 223 224 246 245) fluid (4 12 40) simpleGrading (1 1 1)
    hex (136 137 159 158 224 225 247 246) fluid (8 12 40) simpleGrading (1 1 1)
    hex (137 138 160 159 225 226 248 247) fluid (4 12 40) simpleGrading (1 1 1)
    hex (138 139 161 160 226 227 249 248) fluid (8 12 40) simpleGrading (1 1 1)
    hex (139 140 162 161 227 228 250 249) fluid (4 12 40) simpleGrading (1 1 1)
    hex (140 141 163 162 228 229 251 250) fluid (8 12 40) simpleGrading (1 1 1)
    hex (141 142 164 163 229 230 252 251) fluid (4 12 40) simpleGrading (1 1 1)
    hex (142 143 165 164 230 231 253 252) fluid (8 12 40) simpleGrading (1 1 1)
    hex (143 144 166 165 231 232 254 253) fluid (4 12 40) simpleGrading (1 1 1)
    hex (144 145 167 166 232 233 255 254) fluid (8 12 40) simpleGrading (1 1 1)
    hex (145 146 168 167 233 234 256 255) fluid (4 12 40) simpleGrading (1 1 1)
    hex (146 147 169 168 234 235 257 256) fluid (8 12 40) simpleGrading (1 1 1)
    hex (147 148 170 169 235 236 258 257) fluid (4 12 40) simpleGrading (1 1 1)
    hex (148 149 171 170 236 237 259 258) fluid (8 12 40) simpleGrading (1 1 1)
    hex (149 150 172 171 237 238 260 259) fluid (4 12 40) simpleGrading (1 1 1)
    hex (150 151 173 172 238 239 261 260) fluid (8 12 40) simpleGrading (1 1 1)
    hex (151 152 174 173 239 240 262 261) fluid (4 12 40) simpleGrading (1 1 1)
    hex (152 153 175 174 240 241 263 262) fluid (4 12 40) simpleGrading (1 1 1)
    hex (176 177 199 198 264 265 287 286) fluid (4 4 25) simpleGrading (1 1 1)
    hex (177 178 200 199 265 266 288 287) fluid (4 4 25) simpleGrading (1 1 1)
    hex (178 179 201 200 266 267 289 288) fluid (8 4 25) simpleGrading (1 1 1)
    hex (179 180 202 201 267 268 290 289) fluid (4 4 25) simpleGrading (1 1 1)
    hex (180 181 203 202 268 269 291 290) fluid (8 4 25) simpleGrading (1 1 1)
    hex (181 182 204 203 269 270 292 291) fluid (4 4 25) simpleGrading (1 1 1)
    hex (182 183 205 204 270 271 293 292) fluid (8 4 25) simpleGrading (1 1 1)
    hex (183 184 206 205 271 272 294 293) fluid (4 4 25) simpleGrading (1 1 1)
    hex (184 185 207 206 272 273 295 294) fluid (8 4 25) simpleGrading (1 1 1)
    hex (185 186 208 207 273 274 296 295) fluid (4 4 25) simpleGrading (1 1 1)
    hex (186 187 209 208 274 275 297 296) fluid (8 4 25) simpleGrading (1 1 1)
    hex (187 188 210 209 275 276 298 297) fluid (4 4 25) simpleGrading (1 1 1)
    hex (188 189 211 210 276 277 299 298) fluid (8 4 25) simpleGrading (1 1 1)
    hex (189 190 212 211 277 278 300 299) fluid (4 4 25) simpleGrading (1 1 1)
    hex (190 191 213 212 278 279 301 300) fluid (8 4 25) simpleGrading (1 1 1)
    hex (191 192 214 213 279 280 302 301) fluid (4 4 25) simpleGrading (1 1 1)
    hex (192 193 215 214 280 281 303 302) fluid (8 4 25) simpleGrading (1 1 1)
    hex (193 194 216 215 281 282 304 303) fluid (4 4 25) simpleGrading (1 1 1)
    hex (194 195 217 216 282 283 305 304) fluid (8 4 25) simpleGrading (1 1 1)
    hex (195 196 218 217 283 284 306 305) fluid (4 4 25) simpleGrading (1 1 1)
    hex (196 197 219 218 284 285 307 306) fluid (4 4 25) simpleGrading (1 1 1)
    hex (198 199 221 220 286 287 309 308) fluid (4 18 25) simpleGrading (1 1 1)
    hex (199 200 222 221 287 288 310 309) fluid (4 18 25) simpleGrading (1 1 1)
    hex (200 201 223 222 288 289 311 310) fluid (8 18 25) simpleGrading (1 1 1)
    hex (201 202 224 223 289 290 312 311) fluid (4 18 25) simpleGrading (1 1 1)
    hex (202 203 225 224 290 291 313 312) fluid (8 18 25) simpleGrading (1 1 1)
    hex (203 204 226 225 291 292 314 313) fluid (4 18 25) simpleGrading (1 1 1)
    hex (204 205 227 226 292 293 315 314) fluid (8 18 25) simpleGrading (1 1 1)
    hex (205 206 228 227 293 294 316 315) fluid (4 18 25) simpleGrading (1 1 1)
    hex (206 207 229 228 294 295 317 316) fluid (8 18 25) simpleGrading (1 1 1)
    hex (207 208 230 229 295 296 318 317) fluid (4 18 25) simpleGrading (1 1 1)
    hex (208 209 231 230 296 297 319 318) fluid (8 18 25) simpleGrading (1 1 1)
    hex (209 210 232 231 297 298 320 319) fluid (4 18 25) simpleGrading (1 1 1)
    hex (210 211 233 232 298 299 321 320) fluid (8 18 25) simpleGrading (1 1 1)
    hex (211 212 234 233 299 300 322 321) fluid (4 18 25) simpleGrading (1 1 1)
    hex (212 213 235 234 300 301 323 322) fluid (8 18 25) simpleGrading (1 1 1)
    hex (213 214 236 235 301 302 324 323) fluid (4 18 25) simpleGrading (1 1 1)
    hex (214 215 237 236 302 303 325 324) fluid (8 18 25) simpleGrading (1 1 1)
    hex (215 216 238 237 303 304 326 325) fluid (4 18 25) simpleGrading (1 1 1)
    hex (216 217 239 238 304 305 327 326) fluid (8 18 25) simpleGrading (1 1 1)
    hex (217 218 240 239 305 306 328 327) fluid (4 18 25) simpleGrading (1 1 1)
    hex (218 219 241 240 306 307 329 328) fluid (4 18 25) simpleGrading (1 1 1)
    hex (220 221 243 242 308 309 331 330) fluid (4 12 25) simpleGrading (1 1 1)
    hex (221 222 244 243 309 310 332 331) fluid (4 12 25) simpleGrading (1 1 1)
    hex (222 223 245 244 310 311 333 332) fluid (8 12 25) simpleGrading (1 1 1)
    hex (223 224 246 245 311 312 334 333) fluid (4 12 25) simpleGrading (1 1 1)
    hex (224 225 247 246 312 313 335 334) fluid (8 12 25) simpleGrading (1 1 1)
    hex (225 226 248 247 313 314 336 335) fluid (4 12 25) simpleGrading (1 1 1)
    hex (226 227 249 248 314 315 337 336) fluid (8 12 25) simpleGrading (1 1 1)
    hex (227 228 250 249 315 316 338 337) fluid (4 12 25) simpleGrading (1 1 1)
    hex (228 229 251 250 316 317 339 338) fluid (8 12 25) simpleGrading (1 1 1)
    hex (229 230 252 251 317 318 340 339) fluid (4 12 25) simpleGrading (1 1 1)
    hex (230 231 253 252 318 319 341 340) fluid (8 12 25) simpleGrading (1 1 1)
    hex (231 232 254 253 319 320 342 341) fluid (4 12 25) simpleGrading (1 1 1)
    hex (232 233 255 254 320 321 343 342) fluid (8 12 25) simpleGrading (1 1 1)
    hex (233 234 256 255 321 322 344 343) fluid (4 12 25) simpleGrading (1 1 1)
    hex (234 235 257 256 322 323 345 344) fluid (8 12 25) simpleGrading (1 1 1)
    hex (235 236 258 257 323 324 346 345) fluid (4 12 25) simpleGrading (1 1 1)
    hex (236 237 259 258 324 325 347 346) fluid (8 12 25) simpleGrading (1 1 1)
    hex (237 238 260 259 325 326 348 347) fluid (4 12 25) simpleGrading (1 1 1)
    hex (238 239 261 260 326 327 349 348) fluid (8 12 25) simpleGrading (1 1 1)
    hex (239 240 262 261 327 328 350 349) fluid (4 12 25) simpleGrading (1 1 1)
    hex (240 241 263 262 328 329 351 350) fluid (4 12 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    fan1_half0
    {
        type cyclic;
        neighbourPatch fan1_half1;
        faces
        (
        (0 22 23 1)
        (1 23 24 2)
        (2 24 25 3)
        (3 25 26 4)
        (4 26 27 5)
        (5 27 28 6)
        (6 28 29 7)
        (7 29 30 8)
        (8 30 31 9)
        (9 31 32 10)
        (10 32 33 11)
        (11 33 34 12)
        (12 34 35 13)
        (13 35 36 14)
        (14 36 37 15)
        (15 37 38 16)
        (16 38 39 17)
        (17 39 40 18)
        (18 40 41 19)
        (19 41 42 20)
        (20 42 43 21)
        (22 44 45 23)
        (23 45 46 24)
        (24 46 47 25)
        (25 47 48 26)
        (26 48 49 27)
        (27 49 50 28)
        (28 50 51 29)
        (29 51 52 30)
        (30 52 53 31)
        (31 53 54 32)
        (32 54 55 33)
        (33 55 56 34)
        (34 56 57 35)
        (35 57 58 36)
        (36 58 59 37)
        (37 59 60 38)
        (38 60 61 39)
        (39 61 62 40)
        (40 62 63 41)
        (41 63 64 42)
        (42 64 65 43)
        (44 66 67 45)
        (45 67 68 46)
        (46 68 69 47)
        (47 69 70 48)
        (48 70 71 49)
        (49 71 72 50)
        (50 72 73 51)
        (51 73 74 52)
        (52 74 75 53)
        (53 75 76 54)
        (54 76 77 55)
        (55 77 78 56)
        (56 78 79 57)
        (57 79 80 58)
        (58 80 81 59)
        (59 81 82 60)
        (60 82 83 61)
        (61 83 84 62)
        (62 84 85 63)
        (63 85 86 64)
        (64 86 87 65)
        );
    }
    fan1_half1
    {
        type cyclic;
        neighbourPatch fan1_half0;
        faces
        (
        (0 22 23 1)
        (1 23 24 2)
        (2 24 25 3)
        (3 25 26 4)
        (4 26 27 5)
        (5 27 28 6)
        (6 28 29 7)
        (7 29 30 8)
        (8 30 31 9)
        (9 31 32 10)
        (10 32 33 11)
        (11 33 34 12)
        (12 34 35 13)
        (13 35 36 14)
        (14 36 37 15)
        (15 37 38 16)
        (16 38 39 17)
        (17 39 40 18)
        (18 40 41 19)
        (19 41 42 20)
        (20 42 43 21)
        (22 44 45 23)
        (23 45 46 24)
        (24 46 47 25)
        (25 47 48 26)
        (26 48 49 27)
        (27 49 50 28)
        (28 50 51 29)
        (29 51 52 30)
        (30 52 53 31)
        (31 53 54 32)
        (32 54 55 33)
        (33 55 56 34)
        (34 56 57 35)
        (35 57 58 36)
        (36 58 59 37)
        (37 59 60 38)
        (38 60 61 39)
        (39 61 62 40)
        (40 62 63 41)
        (41 63 64 42)
        (42 64 65 43)
        (44 66 67 45)
        (45 67 68 46)
        (46 68 69 47)
        (47 69 70 48)
        (48 70 71 49)
        (49 71 72 50)
        (50 72 73 51)
        (51 73 74 52)
        (52 74 75 53)
        (53 75 76 54)
        (54 76 77 55)
        (55 77 78 56)
        (56 78 79 57)
        (57 79 80 58)
        (58 80 81 59)
        (59 81 82 60)
        (60 82 83 61)
        (61 83 84 62)
        (62 84 85 63)
        (63 85 86 64)
        (64 86 87 65)
        );
    }
    fan2_half0
    {
        type cyclic;
        neighbourPatch fan2_half1;
        faces
        (
        (264 265 287 286)
        (265 266 288 287)
        (266 267 289 288)
        (267 268 290 289)
        (268 269 291 290)
        (269 270 292 291)
        (270 271 293 292)
        (271 272 294 293)
        (272 273 295 294)
        (273 274 296 295)
        (274 275 297 296)
        (275 276 298 297)
        (276 277 299 298)
        (277 278 300 299)
        (278 279 301 300)
        (279 280 302 301)
        (280 281 303 302)
        (281 282 304 303)
        (282 283 305 304)
        (283 284 306 305)
        (284 285 307 306)
        (286 287 309 308)
        (287 288 310 309)
        (288 289 311 310)
        (289 290 312 311)
        (290 291 313 312)
        (291 292 314 313)
        (292 293 315 314)
        (293 294 316 315)
        (294 295 317 316)
        (295 296 318 317)
        (296 297 319 318)
        (297 298 320 319)
        (298 299 321 320)
        (299 300 322 321)
        (300 301 323 322)
        (301 302 324 323)
        (302 303 325 324)
        (303 304 326 325)
        (304 305 327 326)
        (305 306 328 327)
        (306 307 329 328)
        (308 309 331 330)
        (309 310 332 331)
        (310 311 333 332)
        (311 312 334 333)
        (312 313 335 334)
        (313 314 336 335)
        (314 315 337 336)
        (315 316 338 337)
        (316 317 339 338)
        (317 318 340 339)
        (318 319 341 340)
        (319 320 342 341)
        (320 321 343 342)
        (321 322 344 343)
        (322 323 345 344)
        (323 324 346 345)
        (324 325 347 346)
        (325 326 348 347)
        (326 327 349 348)
        (327 328 350 349)
        (328 329 351 350)
        );
    }
    fan2_half1
    {
        type cyclic;
        neighbourPatch fan2_half0;
        faces
        (
        (264 265 287 286)
        (265 266 288 287)
        (266 267 289 288)
        (267 268 290 289)
        (268 269 291 290)
        (269 270 292 291)
        (270 271 293 292)
        (271 272 294 293)
        (272 273 295 294)
        (273 274 296 295)
        (274 275 297 296)
        (275 276 298 297)
        (276 277 299 298)
        (277 278 300 299)
        (278 279 301 300)
        (279 280 302 301)
        (280 281 303 302)
        (281 282 304 303)
        (282 283 305 304)
        (283 284 306 305)
        (284 285 307 306)
        (286 287 309 308)
        (287 288 310 309)
        (288 289 311 310)
        (289 290 312 311)
        (290 291 313 312)
        (291 292 314 313)
        (292 293 315 314)
        (293 294 316 315)
        (294 295 317 316)
        (295 296 318 317)
        (296 297 319 318)
        (297 298 320 319)
        (298 299 321 320)
        (299 300 322 321)
        (300 301 323 322)
        (301 302 324 323)
        (302 303 325 324)
        (303 304 326 325)
        (304 305 327 326)
        (305 306 328 327)
        (306 307 329 328)
        (308 309 331 330)
        (309 310 332 331)
        (310 311 333 332)
        (311 312 334 333)
        (312 313 335 334)
        (313 314 336 335)
        (314 315 337 336)
        (315 316 338 337)
        (316 317 339 338)
        (317 318 340 339)
        (318 319 341 340)
        (319 320 342 341)
        (320 321 343 342)
        (321 322 344 343)
        (322 323 345 344)
        (323 324 346 345)
        (324 325 347 346)
        (325 326 348 347)
        (326 327 349 348)
        (327 328 350 349)
        (328 329 351 350)
        );
    }
    base_bottom
    {
        type wall;
        faces
        (
        (0 1 89 88)
        (1 2 90 89)
        (2 3 91 90)
        (3 4 92 91)
        (4 5 93 92)
        (5 6 94 93)
        (6 7 95 94)
        (7 8 96 95)
        (8 9 97 96)
        (9 10 98 97)
        (10 11 99 98)
        (11 12 100 99)
        (12 13 101 100)
        (13 14 102 101)
        (14 15 103 102)
        (15 16 104 103)
        (16 17 105 104)
        (17 18 106 105)
        (18 19 107 106)
        (19 20 108 107)
        (20 21 109 108)
        (88 89 177 176)
        (89 90 178 177)
        (90 91 179 178)
        (91 92 180 179)
        (92 93 181 180)
        (93 94 182 181)
        (94 95 183 182)
        (95 96 184 183)
        (96 97 185 184)
        (97 98 186 185)
        (98 99 187 186)
        (99 100 188 187)
        (100 101 189 188)
        (101 102 190 189)
        (102 103 191 190)
        (103 104 192 191)
        (104 105 193 192)
        (105 106 194 193)
        (106 107 195 194)
        (107 108 196 195)
        (108 109 197 196)
        (176 177 265 264)
        (177 178 266 265)
        (178 179 267 266)
        (179 180 268 267)
        (180 181 269 268)
        (181 182 270 269)
        (182 183 271 270)
        (183 184 272 271)
        (184 185 273 272)
        (185 186 274 273)
        (186 187 275 274)
        (187 188 276 275)
        (188 189 277 276)
        (189 190 278 277)
        (190 191 279 278)
        (191 192 280 279)
        (192 193 281 280)
        (193 194 282 281)
        (194 195 283 282)
        (195 196 284 283)
        (196 197 285 284)
        );
    }
    top_wall
    {
        type wall;
        faces
        (
        (66 154 155 67)
        (67 155 156 68)
        (68 156 157 69)
        (69 157 158 70)
        (70 158 159 71)
        (71 159 160 72)
        (72 160 161 73)
        (73 161 162 74)
        (74 162 163 75)
        (75 163 164 76)
        (76 164 165 77)
        (77 165 166 78)
        (78 166 167 79)
        (79 167 168 80)
        (80 168 169 81)
        (81 169 170 82)
        (82 170 171 83)
        (83 171 172 84)
        (84 172 173 85)
        (85 173 174 86)
        (86 174 175 87)
        (154 242 243 155)
        (155 243 244 156)
        (156 244 245 157)
        (157 245 246 158)
        (158 246 247 159)
        (159 247 248 160)
        (160 248 249 161)
        (161 249 250 162)
        (162 250 251 163)
        (163 251 252 164)
        (164 252 253 165)
        (165 253 254 166)
        (166 254 255 167)
        (167 255 256 168)
        (168 256 257 169)
        (169 257 258 170)
        (170 258 259 171)
        (171 259 260 172)
        (172 260 261 173)
        (173 261 262 174)
        (174 262 263 175)
        (242 330 331 243)
        (243 331 332 244)
        (244 332 333 245)
        (245 333 334 246)
        (246 334 335 247)
        (247 335 336 248)
        (248 336 337 249)
        (249 337 338 250)
        (250 338 339 251)
        (251 339 340 252)
        (252 340 341 253)
        (253 341 342 254)
        (254 342 343 255)
        (255 343 344 256)
        (256 344 345 257)
        (257 345 346 258)
        (258 346 347 259)
        (259 347 348 260)
        (260 348 349 261)
        (261 349 350 262)
        (262 350 351 263)
        );
    }
    side_walls
    {
        type wall;
        faces
        (
        (0 88 110 22)
        (21 43 131 109)
        (22 110 132 44)
        (43 65 153 131)
        (44 132 154 66)
        (65 87 175 153)
        (88 176 198 110)
        (109 131 219 197)
        (110 198 220 132)
        (131 153 241 219)
        (132 220 242 154)
        (153 175 263 241)
        (176 264 286 198)
        (197 219 307 285)
        (198 286 308 220)
        (219 241 329 307)
        (220 308 330 242)
        (241 263 351 329)
        );
    }
);

mergePatchPairs
(
);