Parametric Heatsink Simulation/Linux Files/pitch_7mm_nfins_10/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     chtMultiRegionSimpleFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         1000;

deltaT          1;

writeControl    timeStep;
writeInterval   100;
purgeWrite      3;

writeFormat     ascii;
writePrecision  8;

runTimeModifiable true;

functions
{
    // Sample outlet bulk temperature and max solid temperature each write interval
    fieldMinMax
    {
        type            fieldMinMax;
        libs            ("libfieldFunctionObjects.so");
        fields          (T);
        location        true;
        writeToFile     true;
    }
}
